{
  "__afr__": 256001,
  "__amh__": 256002,
  "__arb__": 256003,
  "__ary__": 256004,
  "__arz__": 256005,
  "__asm__": 256006,
  "__azj__": 256007,
  "__bel__": 256008,
  "__ben__": 256009,
  "__bos__": 256010,
  "__bul__": 256011,
  "__cat__": 256012,
  "__ceb__": 256013,
  "__ces__": 256014,
  "__ckb__": 256015,
  "__cmn_Hant__": 256017,
  "__cmn__": 256016,
  "__cym__": 256018,
  "__dan__": 256019,
  "__deu__": 256020,
  "__ell__": 256021,
  "__eng__": 256022,
  "__est__": 256023,
  "__eus__": 256024,
  "__fin__": 256025,
  "__fra__": 256026,
  "__fuv__": 256027,
  "__gaz__": 256028,
  "__gle__": 256029,
  "__glg__": 256030,
  "__guj__": 256031,
  "__heb__": 256032,
  "__hin__": 256033,
  "__hrv__": 256034,
  "__hun__": 256035,
  "__hye__": 256036,
  "__ibo__": 256037,
  "__ind__": 256038,
  "__isl__": 256039,
  "__ita__": 256040,
  "__jav__": 256041,
  "__jpn__": 256042,
  "__kan__": 256043,
  "__kat__": 256044,
  "__kaz__": 256045,
  "__khk__": 256046,
  "__khm__": 256047,
  "__kir__": 256048,
  "__kor__": 256049,
  "__lao__": 256050,
  "__lit__": 256051,
  "__lug__": 256052,
  "__luo__": 256053,
  "__lvs__": 256054,
  "__mai__": 256055,
  "__mal__": 256056,
  "__mar__": 256057,
  "__mkd__": 256058,
  "__mlt__": 256059,
  "__mni__": 256060,
  "__mya__": 256061,
  "__nld__": 256062,
  "__nno__": 256063,
  "__nob__": 256064,
  "__npi__": 256065,
  "__nya__": 256066,
  "__ory__": 256067,
  "__pan__": 256068,
  "__pbt__": 256069,
  "__pes__": 256070,
  "__pol__": 256071,
  "__por__": 256072,
  "__ron__": 256073,
  "__rus__": 256074,
  "__sat__": 256075,
  "__slk__": 256076,
  "__slv__": 256077,
  "__sna__": 256078,
  "__snd__": 256079,
  "__som__": 256080,
  "__spa__": 256081,
  "__srp__": 256082,
  "__swe__": 256083,
  "__swh__": 256084,
  "__tam__": 256085,
  "__tel__": 256086,
  "__tgk__": 256087,
  "__tgl__": 256088,
  "__tha__": 256089,
  "__tur__": 256090,
  "__ukr__": 256091,
  "__urd__": 256092,
  "__uzn__": 256093,
  "__vie__": 256094,
  "__yor__": 256095,
  "__yue__": 256096,
  "__zlm__": 256097,
  "__zul__": 256098
}
