{
  "metadata": {
    "total_size": 9236998676
  },
  "weight_map": {
    "shared.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.adapter.layers.0.ffn.intermediate_dense.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.adapter.layers.0.ffn.intermediate_dense.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.adapter.layers.0.ffn.output_dense.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.adapter.layers.0.ffn.output_dense.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.adapter.layers.0.ffn_layer_norm.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.adapter.layers.0.ffn_layer_norm.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.adapter.layers.0.residual_conv.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.adapter.layers.0.residual_conv.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.adapter.layers.0.residual_layer_norm.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.adapter.layers.0.residual_layer_norm.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.adapter.layers.0.self_attn.linear_k.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.adapter.layers.0.self_attn.linear_k.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.adapter.layers.0.self_attn.linear_out.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.adapter.layers.0.self_attn.linear_out.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.adapter.layers.0.self_attn.linear_q.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.adapter.layers.0.self_attn.linear_q.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.adapter.layers.0.self_attn.linear_v.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.adapter.layers.0.self_attn.linear_v.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.adapter.layers.0.self_attn_conv.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.adapter.layers.0.self_attn_conv.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.adapter.layers.0.self_attn_layer_norm.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.adapter.layers.0.self_attn_layer_norm.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layer_norm.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layer_norm.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.conv_module.depthwise_conv.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.conv_module.depthwise_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.conv_module.depthwise_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.conv_module.layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.conv_module.layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.conv_module.pointwise_conv1.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.conv_module.pointwise_conv2.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.ffn1.intermediate_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.ffn1.intermediate_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.ffn1.output_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.ffn1.output_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.ffn1_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.ffn1_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.ffn2.intermediate_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.ffn2.intermediate_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.ffn2.output_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.ffn2.output_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.ffn2_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.ffn2_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.self_attn.distance_embedding.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.self_attn.linear_k.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.self_attn.linear_k.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.self_attn.linear_out.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.self_attn.linear_out.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.self_attn.linear_q.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.self_attn.linear_q.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.self_attn.linear_v.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.self_attn.linear_v.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.0.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.conv_module.depthwise_conv.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.conv_module.depthwise_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.conv_module.depthwise_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.conv_module.layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.conv_module.layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.conv_module.pointwise_conv1.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.conv_module.pointwise_conv2.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.ffn1.intermediate_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.ffn1.intermediate_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.ffn1.output_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.ffn1.output_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.ffn1_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.ffn1_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.ffn2.intermediate_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.ffn2.intermediate_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.ffn2.output_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.ffn2.output_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.ffn2_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.ffn2_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.self_attn.distance_embedding.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.self_attn.linear_k.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.self_attn.linear_k.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.self_attn.linear_out.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.self_attn.linear_out.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.self_attn.linear_q.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.self_attn.linear_q.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.self_attn.linear_v.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.self_attn.linear_v.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.1.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.conv_module.depthwise_conv.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.conv_module.depthwise_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.conv_module.depthwise_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.conv_module.layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.conv_module.layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.conv_module.pointwise_conv1.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.conv_module.pointwise_conv2.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.ffn1.intermediate_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.ffn1.intermediate_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.ffn1.output_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.ffn1.output_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.ffn1_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.ffn1_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.ffn2.intermediate_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.ffn2.intermediate_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.ffn2.output_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.ffn2.output_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.ffn2_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.ffn2_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.self_attn.distance_embedding.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.self_attn.linear_k.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.self_attn.linear_k.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.self_attn.linear_out.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.self_attn.linear_out.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.self_attn.linear_q.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.self_attn.linear_q.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.self_attn.linear_v.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.self_attn.linear_v.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.10.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.conv_module.depthwise_conv.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.conv_module.depthwise_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.conv_module.depthwise_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.conv_module.layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.conv_module.layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.conv_module.pointwise_conv1.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.conv_module.pointwise_conv2.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.ffn1.intermediate_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.ffn1.intermediate_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.ffn1.output_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.ffn1.output_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.ffn1_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.ffn1_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.ffn2.intermediate_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.ffn2.intermediate_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.ffn2.output_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.ffn2.output_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.ffn2_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.ffn2_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.self_attn.distance_embedding.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.self_attn.linear_k.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.self_attn.linear_k.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.self_attn.linear_out.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.self_attn.linear_out.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.self_attn.linear_q.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.self_attn.linear_q.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.self_attn.linear_v.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.self_attn.linear_v.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.11.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.conv_module.depthwise_conv.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.conv_module.depthwise_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.conv_module.depthwise_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.conv_module.layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.conv_module.layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.conv_module.pointwise_conv1.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.conv_module.pointwise_conv2.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.ffn1.intermediate_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.ffn1.intermediate_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.ffn1.output_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.ffn1.output_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.ffn1_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.ffn1_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.ffn2.intermediate_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.ffn2.intermediate_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.ffn2.output_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.ffn2.output_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.ffn2_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.ffn2_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.self_attn.distance_embedding.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.self_attn.linear_k.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.self_attn.linear_k.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.self_attn.linear_out.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.self_attn.linear_out.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.self_attn.linear_q.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.self_attn.linear_q.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.self_attn.linear_v.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.self_attn.linear_v.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.12.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.conv_module.depthwise_conv.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.conv_module.depthwise_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.conv_module.depthwise_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.conv_module.layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.conv_module.layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.conv_module.pointwise_conv1.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.conv_module.pointwise_conv2.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.ffn1.intermediate_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.ffn1.intermediate_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.ffn1.output_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.ffn1.output_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.ffn1_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.ffn1_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.ffn2.intermediate_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.ffn2.intermediate_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.ffn2.output_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.ffn2.output_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.ffn2_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.ffn2_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.self_attn.distance_embedding.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.self_attn.linear_k.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.self_attn.linear_k.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.self_attn.linear_out.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.self_attn.linear_out.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.self_attn.linear_q.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.self_attn.linear_q.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.self_attn.linear_v.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.self_attn.linear_v.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.13.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.conv_module.depthwise_conv.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.conv_module.depthwise_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.conv_module.depthwise_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.conv_module.layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.conv_module.layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.conv_module.pointwise_conv1.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.conv_module.pointwise_conv2.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.ffn1.intermediate_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.ffn1.intermediate_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.ffn1.output_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.ffn1.output_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.ffn1_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.ffn1_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.ffn2.intermediate_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.ffn2.intermediate_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.ffn2.output_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.ffn2.output_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.ffn2_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.ffn2_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.self_attn.distance_embedding.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.self_attn.linear_k.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.self_attn.linear_k.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.self_attn.linear_out.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.self_attn.linear_out.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.self_attn.linear_q.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.self_attn.linear_q.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.self_attn.linear_v.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.self_attn.linear_v.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.14.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.conv_module.depthwise_conv.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.conv_module.depthwise_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.conv_module.depthwise_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.conv_module.layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.conv_module.layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.conv_module.pointwise_conv1.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.conv_module.pointwise_conv2.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.ffn1.intermediate_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.ffn1.intermediate_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.ffn1.output_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.ffn1.output_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.ffn1_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.ffn1_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.ffn2.intermediate_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.ffn2.intermediate_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.ffn2.output_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.ffn2.output_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.ffn2_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.ffn2_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.self_attn.distance_embedding.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.self_attn.linear_k.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.self_attn.linear_k.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.self_attn.linear_out.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.self_attn.linear_out.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.self_attn.linear_q.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.self_attn.linear_q.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.self_attn.linear_v.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.self_attn.linear_v.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.15.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.conv_module.depthwise_conv.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.conv_module.depthwise_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.conv_module.depthwise_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.conv_module.layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.conv_module.layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.conv_module.pointwise_conv1.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.conv_module.pointwise_conv2.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.ffn1.intermediate_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.ffn1.intermediate_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.ffn1.output_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.ffn1.output_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.ffn1_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.ffn1_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.ffn2.intermediate_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.ffn2.intermediate_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.ffn2.output_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.ffn2.output_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.ffn2_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.ffn2_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.self_attn.distance_embedding.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.self_attn.linear_k.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.self_attn.linear_k.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.self_attn.linear_out.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.self_attn.linear_out.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.self_attn.linear_q.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.self_attn.linear_q.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.self_attn.linear_v.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.self_attn.linear_v.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.16.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.conv_module.depthwise_conv.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.conv_module.depthwise_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.conv_module.depthwise_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.conv_module.layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.conv_module.layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.conv_module.pointwise_conv1.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.conv_module.pointwise_conv2.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.ffn1.intermediate_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.ffn1.intermediate_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.ffn1.output_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.ffn1.output_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.ffn1_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.ffn1_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.ffn2.intermediate_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.ffn2.intermediate_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.ffn2.output_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.ffn2.output_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.ffn2_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.ffn2_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.self_attn.distance_embedding.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.self_attn.linear_k.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.self_attn.linear_k.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.self_attn.linear_out.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.self_attn.linear_out.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.self_attn.linear_q.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.self_attn.linear_q.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.self_attn.linear_v.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.self_attn.linear_v.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.17.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.conv_module.depthwise_conv.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.conv_module.depthwise_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.conv_module.depthwise_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.conv_module.layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.conv_module.layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.conv_module.pointwise_conv1.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.conv_module.pointwise_conv2.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.ffn1.intermediate_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.ffn1.intermediate_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.ffn1.output_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.ffn1.output_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.ffn1_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.ffn1_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.ffn2.intermediate_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.ffn2.intermediate_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.ffn2.output_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.ffn2.output_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.ffn2_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.ffn2_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.self_attn.distance_embedding.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.self_attn.linear_k.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.self_attn.linear_k.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.self_attn.linear_out.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.self_attn.linear_out.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.self_attn.linear_q.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.self_attn.linear_q.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.self_attn.linear_v.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.self_attn.linear_v.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.18.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.conv_module.depthwise_conv.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.conv_module.depthwise_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.conv_module.depthwise_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.conv_module.layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.conv_module.layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.conv_module.pointwise_conv1.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.conv_module.pointwise_conv2.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.ffn1.intermediate_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.ffn1.intermediate_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.ffn1.output_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.ffn1.output_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.ffn1_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.ffn1_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.ffn2.intermediate_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.ffn2.intermediate_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.ffn2.output_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.ffn2.output_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.ffn2_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.ffn2_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.self_attn.distance_embedding.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.self_attn.linear_k.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.self_attn.linear_k.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.self_attn.linear_out.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.self_attn.linear_out.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.self_attn.linear_q.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.self_attn.linear_q.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.self_attn.linear_v.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.self_attn.linear_v.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.19.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.conv_module.depthwise_conv.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.conv_module.depthwise_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.conv_module.depthwise_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.conv_module.layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.conv_module.layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.conv_module.pointwise_conv1.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.conv_module.pointwise_conv2.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.ffn1.intermediate_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.ffn1.intermediate_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.ffn1.output_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.ffn1.output_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.ffn1_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.ffn1_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.ffn2.intermediate_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.ffn2.intermediate_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.ffn2.output_dense.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.ffn2.output_dense.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.ffn2_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.ffn2_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.final_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.final_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.self_attn.distance_embedding.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.self_attn.linear_k.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.self_attn.linear_k.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.self_attn.linear_out.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.self_attn.linear_out.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.self_attn.linear_q.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.self_attn.linear_q.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.self_attn.linear_v.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.self_attn.linear_v.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.self_attn_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.2.self_attn_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.conv_module.depthwise_conv.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.conv_module.depthwise_layer_norm.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.conv_module.depthwise_layer_norm.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.conv_module.layer_norm.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.conv_module.layer_norm.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.conv_module.pointwise_conv1.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.conv_module.pointwise_conv2.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.ffn1.intermediate_dense.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.ffn1.intermediate_dense.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.ffn1.output_dense.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.ffn1.output_dense.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.ffn1_layer_norm.bias": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.ffn1_layer_norm.weight": "model-00001-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.ffn2.intermediate_dense.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.ffn2.intermediate_dense.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.ffn2.output_dense.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.ffn2.output_dense.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.ffn2_layer_norm.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.ffn2_layer_norm.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.final_layer_norm.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.final_layer_norm.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.self_attn.distance_embedding.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.self_attn.linear_k.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.self_attn.linear_k.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.self_attn.linear_out.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.self_attn.linear_out.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.self_attn.linear_q.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.self_attn.linear_q.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.self_attn.linear_v.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.self_attn.linear_v.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.self_attn_layer_norm.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.20.self_attn_layer_norm.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.21.conv_module.depthwise_conv.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.21.conv_module.depthwise_layer_norm.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.21.conv_module.depthwise_layer_norm.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.21.conv_module.layer_norm.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.21.conv_module.layer_norm.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.21.conv_module.pointwise_conv1.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.21.conv_module.pointwise_conv2.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.21.ffn1.intermediate_dense.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.21.ffn1.intermediate_dense.weight": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.21.ffn1.output_dense.bias": "model-00002-of-00002.safetensors",
    "speech_encoder.encoder.layers.21.ffn1.output_dense.weight": "model-00002-of-00002.safetensors",
